bfs_test/0/nuTilda4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 4.65e-5; //3*nu_inf

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
   }
    outlet
    {
        type zeroGradient;
    }
    frontAndBack
    {
       type empty;
    }
    noslipwall
    {
       type zeroGradient;
    }
}
// ************************************************************************* //
