bfs_test/0/nut1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
     {
         type            fixedValue;
        value 1.0198e-05;
     }
    outlet
     {
         type            zeroGradient;
        //value           uniform 0;
     }
    frontAndBack
     {
       type empty;
     }
     noslipwall
    {
        type            nutUSpaldingWallFunction;;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0; 
}
    
}


// ************************************************************************* //

