bfs_test/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
1735
(
1.15584e-05
2.22094e-12
1.15584e-05
-2.39426e-11
1.1559e-05
-5.53832e-10
1.15655e-05
-6.49171e-09
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
-1.15584e-05
-1.49282e-05
-1.92806e-05
-2.49018e-05
-3.21619e-05
-4.15387e-05
-5.36493e-05
-6.92908e-05
-8.94925e-05
-0.000115584
-0.000346752
-0.000268477
-0.000207872
-0.000160948
-0.000124616
-9.64858e-05
-7.47054e-05
-5.78417e-05
-4.47847e-05
-3.46752e-05
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
35
(
2.60463e-06
3.16048e-06
3.83495e-06
4.65335e-06
5.64641e-06
6.8514e-06
8.31353e-06
1.00877e-05
...
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
    noslipwall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
