bfs_test/0/phi2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
1735
(
1.32348e-05
2.54431e-12
1.32349e-05
-2.74163e-11
1.32355e-05
-6.34162e-10
1.32429e-05
-7.43328e-09
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
-1.32349e-05
-1.70935e-05
-2.20771e-05
-2.85136e-05
-3.68268e-05
-4.75636e-05
-6.14307e-05
-7.93409e-05
-0.000102473
-0.000132349
-0.000397046
-0.000307418
-0.000238023
-0.000184292
-0.000142691
-0.00011048
-8.55409e-05
-6.62312e-05
-5.12804e-05
-3.97046e-05
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
35
(
2.98241e-06
3.61888e-06
4.39118e-06
5.32829e-06
6.46538e-06
7.84514e-06
9.51935e-06
1.15508e-05
...
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
    noslipwall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
