bfs_test/0/phi3
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
1735
(
1.40747e-05
2.70599e-12
1.40747e-05
-2.91562e-11
1.40754e-05
-6.74402e-10
1.40833e-05
-7.90495e-09
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
-1.40747e-05
-1.81781e-05
-2.34779e-05
-3.03229e-05
-3.91636e-05
-5.05817e-05
-6.53288e-05
-8.43754e-05
-0.000108975
-0.000140747
-0.00042224
-0.000326925
-0.000253126
-0.000195986
-0.000151745
-0.000117491
-9.09688e-05
-7.04338e-05
-5.45344e-05
-4.2224e-05
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
35
(
3.17166e-06
3.84852e-06
4.66982e-06
5.66639e-06
6.87564e-06
8.34294e-06
1.01234e-05
1.22838e-05
...
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
    noslipwall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
