bfs_test/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: plus |
| \\ / A nd | Web: www.OpenFOAM.com |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
version 2.0;
format ascii;
class dictionary;
object blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.0508;
vertices
(
(-15 0 0)
(3.75 0 0)
(3.75 0.5 0)
(-15 0.5 0)
(3.75 2 0)
(-15 2 0)
(10 2 0)
(10 0.5 0)
(10 0 0)
(10 -0.25 0)
(3.75 -0.25 0)
(-15 0 0.01)
(3.75 0 0.01)
(3.75 0.5 0.01)
(-15 0.5 0.01)
(3.75 2 0.01)
(-15 2 0.01)
(10 2 0.01)
(10 0.5 0.01)
(10 0 0.01)
(10 -0.25 0.01)
(3.75 -0.25 0.01));
blocks
(
hex (0 1 2 3 11 12 13 14) (10 10 1) simpleGrading (0.02 10 1)
hex (3 2 4 5 14 13 15 16) (10 10 1) simpleGrading (0.02 0.1 1)
hex (2 7 6 4 13 18 17 15) (20 10 1) simpleGrading (8 0.1 1)
hex (1 8 7 2 12 19 18 13) (20 10 1) simpleGrading (8 10 1)
hex (10 9 8 1 21 20 19 12) (20 15 1) simpleGrading (8 15 1)
);
edges
(
);
boundary
(
inlet
{
type patch;
faces
(
(0 11 14 3)
(3 14 16 5)
);
}
outlet
{
type patch;
faces
(
(9 8 19 20)
(8 7 18 19)
(7 6 17 18)
);
}
frontAndBack
{
type empty;
faces
(
(0 3 2 1)
(11 12 13 14)
(3 5 4 2)
(13 15 16 14)
(2 4 6 7)
(13 18 17 15)
(1 2 7 8)
(12 19 18 13)
(10 1 8 9)
(21 20 19 12)
);
}
noslipwall
{
type wall;
faces
(
(4 5 16 15)
(4 15 17 6)
(0 1 12 11)
(9 20 21 10)
(1 10 21 12)
);
}
);
mergePatchPairs
(
);
// ************************************************************************* //

// ************************************************************************* //
